src/cf/BusinessProcesses/уатСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>уатСогласование</Name>
			<BasedOn>
				<xr:Item>Document.уатВводВЭксплуатациюТСиОборудования</xr:Item>
				<xr:Item>Document.уатВыбытиеТСиОборудования</xr:Item>
				<xr:Item>Document.уатПеремещениеТСиОборудования</xr:Item>
				<xr:Item>Document.уатЗаявкаНаРасходованиеДС</xr:Item>
				<xr:Item>Document.уатУстановкаТарифовЗП</xr:Item>
				<xr:Item>Document.уатУстановкаПрейскурантовТС</xr:Item>
				<xr:Item>Document.уатАктСверкиВзаиморасчетов_уэ</xr:Item>
				<xr:Item>Document.уатУстановкаТарифовСебестоимости_уэ</xr:Item>
				<xr:Item>Document.уатРеестрПеревозок</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатСчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.уатВнутреннееПеремещение</xr:Item>
				<xr:Item>Document.уатПеремещениеТоваров</xr:Item>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
				<xr:Item>Document.уатПотребностьВПеревозке_уэ</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторитьСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеестрПеревозок</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПланированиеРаботыТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАктСверкиВзаиморасчетов_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатУстановкаТарифовЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРасходованиеДС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВнутреннееПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатУстановкаПрейскурантовТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПотребностьВПеревозке_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРекламация_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПеремещениеТСиОборудования</v8:Type>
						<v8:Type>cfg:DocumentRef.уатУстановкаТарифовСебестоимости_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВводВЭксплуатациюТСиОборудования</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВыбытиеТСиОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>В днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШаблоныСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВажность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьуатВажность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаИсполнителя</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИтерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСогласования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРезультатыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыОзнакомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаИсполнителя</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИтерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправленоНаПовторноеСогласование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/BusinessProcesses/уатСогласование/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ВсеЗадачи.Отбор, "БизнесПроцесс", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("БизнесПроцессИзменен", Объект.Ссылка);
	Если Объект.Стартован Тогда
		Оповестить("БизнесПроцессСтартован", Объект.Ссылка);
	КонецЕсли;
	
	ОбновлениеОтображения();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(Новый ОписаниеОповещения("ВсеЗадачиПередНачаломИзмененияЗавершение", ЭтотОбъект), Элементы.ВсеЗадачи.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Предмет) И (НЕ ЗначениеЗаполнено(Объект.Наименование) ИЛИ Объект.Наименование = "Согласовать ") Тогда 
		ТекстНСТР = НСтр("en='Agreed ""%1""';ru='Согласовать ""%1""'");
		Объект.Наименование = СтрШаблон(ТекстНСТР, Объект.Предмет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнители

&НаКлиенте
Процедура ИсполнителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Карта(Команда)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("БизнесПроцесс.уатСогласование.Форма.КартаМаршрута", Новый Структура("БизнесПроцесс", Объект.Ссылка), ЭтотОбъект);
	Иначе
		ТекстНСТР = НСтр("en='Business process is not recorded!';ru='Бизнес-процесс не записан!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	РезультатВыбора = Неопределено;

	ОткрытьФорму("Справочник.уатШаблоныСогласования.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ЗаполнитьПоШаблонуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновлениеОтображения()
	Если Объект.Стартован Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаВариант.Доступность = Ложь;
		Элементы.ФормаЗаполнитьПоШаблону.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатВыбора = Результат;
    Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.уатШаблоныСогласования") И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(РезультатВыбора, "ЭтоГруппа") = ЛОЖЬ Тогда 
        ЗаполнитьПоШаблонуСервер(РезультатВыбора);
        Модифицированность = Истина;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуСервер(Шаблон)
	СогласованиеОбъект = РеквизитФормыВЗначение("Объект");
	СогласованиеОбъект.ЗаполнитьПоШаблону(Шаблон);
	ЗначениеВРеквизитФормы(СогласованиеОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗадачиПередНачаломИзмененияЗавершение(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

#КонецОбласти
